//цикл з лічильноком
// for(let b = 0; b < 5; b += 1) {
//     console.log(b)
// }

// 1 запускаємо цикл та ініціалізуємо лічилькик let b = 0
// 2 далі спрацьовує перевірка умовт b < 5, тобто 0 менше 5, буде тру
// 3 оскільки в умові тру то виконаєтся умова в фігурних дужках (тіло циклу), тобто консоль.лог(б), console.log(0)
// 4 спрацьовує б += 1, тобто б = 0 + 1
// 5 тепер в б лежить 1, та переходимо до наступної ітерації (друге коло)
// 6 спрацьовує перевірка умови б < 5, тобто 1 менше 5, буде тру
// 7 оскільки в умові тру то виконаєтся умова в фігурних дужках (тіло циклу), тобто консоль.лог(б), console.log(1)
// 8 спрацьовує б += 1, тобто б = 1 + 1
// 9 тепер в б лежить 2, та переходимо до наступної ітерації (третє коло)
// 10 спрацьовує перевірка умови б < 5, тобто 2 менше 5, буде тру
// 11 оскільки в умові тру то виконаєтся умова в фігурних дужках (тіло циклу), тобто консоль.лог(б), console.log(2)
// 12 спрацьовує б += 1, тобто б = 2 + 1
// 13 тепер в б лежить 3, та переходимо до наступної ітерації (четверте коло)
// 14 спрацьовує перевірка умови б < 5, тобто 3 менше 5, буде тру
// 15 оскільки в умові тру то виконаєтся умова в фігурних дужках (тіло циклу), тобто консоль.лог(б), console.log(3)
// 16 спрацьовує б += 1, тобто б = 3 + 1
// 17 тепер в б лежить 4, та переходимо до наступної ітерації (п'яте коло)
// 18 спрацьовує перевірка умови б < 5, тобто 4 менше 5, буде тру
// 19 оскільки в умові тру то виконаєтся умова в фігурних дужках (тіло циклу), тобто консоль.лог(б), console.log(4)
// 20 спрацьовує б += 1, тобто б = 4 + 1
// 21 тепер в б лежить 5, та переходимо до наступної ітерації (шосте коло)
// 22 спрацьовує перевірка умови б < 5, тобто 5 менше 5, буде фолс
// 23 оскільки в умові фолс то не виконаєтся тіло в фігурних дужках (тіло циклу), 
// 24 цикл завершує своє виконання


// for(let x = 1; x < 100; x += 2) {
//     console.log(x)
// }

// оператор  brake потрібен для переривання циклу
// напоиклад переберомо число від 5 до 75 і перервемот цикл коли знайдемо 25

// for (let y = 5; y < 75; y += 1){
//     console.log(y)
    // if ( y === 25){
    //     alert('ми знайшли число 25')
    //     break
    // }
// }

// оператор continue пропускає ітерацію
// for (let y = 5; y < 75; y += 1) {
//     if (y % 2 !== 0){
//         continue
//     }
//     console.log(y)
// }

// while (умова){тіло з інструкції}

// const age = Number(prompt("скільки вам років"))
// while (age < 18){
//     alert('Ви малий')
// }
//буде зациклення оскільки умова завжди true

// let age = Number(prompt("скільки вам років"))
// while (age < 18){
//     alert(`Вам тільки ${age} років`)
//     age += 1;
// }


//цикл do {} while ()

// let password;
// const savedPassword = 'qwertyuiop'
// do {
//     password = prompt('enter your new password')
// } while (savedPassword !== password)



//Практика

// for(let b = 1; b < 6; b += 1) {
//     console.log(b)
// }

// let h = 1
// while (h < 6) {
//     console.log(h)
//     h += 1
// }


// let h = 1;
// do { 
//     console.log (h)
//     h += 1;
// } while (h < 6)

// let number = 1;
// while (number < 6) {
//     console.log(`Число ${number}`)
//     number += 1;
// }

// const firstPoint = Number(prompt('Ваша перша оцінка'))
// const secondPoint = Number(prompt('Ваша друга оцінка'))

// let number;
// do{
//     number = Number(prompt('Введіть число від 1 до 100'))
//     alert(`${number}`)
//     number += 1;
// } while(number > 100) 

//Напиши скрипт який підраховує загальну суму зп працівників. Кількість робітників зберігається в змінній employees. ЗП кожного працівника це випадкове число від 500 до 5000.  Записати суму в змінну totalSalary і вивести в на сторінку.

// const employees = Number(prompt("Скільки працівників?"))
// let totalSalary = 0;

// for(let i = 0; i <= employees; i += 1 ) {
//     let x =  Math.round(Math.random() * (5000 - 500) + 500);
//     totalSalary = totalSalary + x;
//     console.log(x)
// }

// alert(`${totalSalary}`)
// let country = prompt("З якої країни буде доставкa?").toLowerCase()
// switch(country){
//     case "китай":
//         alert('Доставка з Китаю буде коштувати 100 кредитів')
//         break;
//         case "чилі":
//         alert('Доставка з Чиллі буде коштувати 250 кредитів')
//         break;
//         case "австралія":
//         alert('Доставка з Австрвлії буде коштувати 170 кредитів')
//         break;
//         case "індія":
//         alert('Доставка з Індії буде коштувати 80 кредитів')
//         break;
//         case "ямайка":
//         alert('Доставка з Ямайки буде коштувати 120 кредитів')
//         break;
//         default:
//         alert('У вашій країні доставка недоступна')
// }

// let total = 0; 
// let input;
// do{
//     input = prompt('Введіть числа і вони будуть додаватися поки ви не натиснете кнопку скасувати');
//     if (!isNaN(Number(input))){
//        total += Number(input)
//     } else {
//         alert('Було написано не число, спробуйте ще раз')
//     }
// }while(input !== null)
//     alert(total)

// while (input !== null || input !== "" || input !== undefined) {
//         let input = prompt('Введіть числа і вони будуть додаватися поки ви не натиснете кнопку скасувати');
//     if (!isNaN(Number(input))){
//        total += Number(input)
//     } else {
//         alert('Було написано не число, спробуйте ще раз')
//     }
// }
// alert(total)


// let input;
// while(input !==0 || Number(input) > 100){
//   input = prompt("Введіть число")
// }

// let min = prompt("Введіть менше число")
// let max = prompt("Введіть більше число")
// for(i = min; i >= max; 1+=1){
//     if
// }





//Напиши скрипт який порахує суму всіх парних чисел, які входять в діапазон чисел в змінних від min до max. Наприклад, якщо min=0 и max=5, то діапазон 0-5, і в ньому 2 парних числа - 2 та 4, їх сума 6. Можна зробити отримання значень мінімального і максимального числа через інпут.