//область видимості буває :
//1. Глобальна доступна в будь якому місці коду 
//2. Блочна доступна тільки в певній області в якій була створена "фігурні душки"


// if (12 < 30) {
//     //Блочна область
//     const x = 12;
//     console.log (x)
// }
// console.log(x)

//фігурні душки створ блочну область


// for (const product of []) {
//     const b = 31;
// console.log (b)
// }



// function test(){
//     const d = 43;
// }

// console.log(d)

// if (12 < 30) {

//     if (true) {
//         const y = 22;
//     }
//     console.log(y)
// }